module TDPE.Contexts {ℓ} (𝒯 : Set ℓ) where

open import Level

infixl 4 _·_

data 𝒞 : Set ℓ where
  𝟙   : 𝒞
  _·_ : 𝒞 → 𝒯 → 𝒞

[_] = λ A → 𝟙 · A

_⊕_ : 𝒞 → 𝒞 → 𝒞
Γ ⊕ 𝟙       = Γ
Γ ⊕ (Δ · A) = (Γ ⊕ Δ) · A

data 𝒲 : 𝒞 → 𝒞 → Set ℓ where
  ϵ₀ : 𝒲 𝟙 𝟙
  ω₁ : ∀ {Γ Δ A} → 𝒲 Γ Δ → 𝒲 (Γ · A) Δ
  ω₂ : ∀ {Γ Δ A} → 𝒲 Γ Δ → 𝒲 (Γ · A) (Δ · A)

_∘_ : ∀ {Γ₁ Γ₂ Γ₃} → 𝒲 Γ₁ Γ₂ → 𝒲 Γ₂ Γ₃ → 𝒲 Γ₁ Γ₃
ϵ₀   ∘ w'    = w'
ω₁ w ∘ w'    = ω₁ (w ∘ w')
ω₂ w ∘ ω₁ w' = ω₁ (w ∘ w')
ω₂ w ∘ ω₂ w' = ω₂ (w ∘ w')

ϵ : ∀ {Γ} → 𝒲 Γ Γ
ϵ {𝟙}     = ϵ₀
ϵ {_ · _} = ω₂ ϵ

𝒲+ : ∀ {a} (𝓟 : 𝒞 → Set a) → Set (ℓ ⊔ a)
𝒲+ 𝓟 = ∀ {Γ Δ} → 𝒲 Γ Δ → 𝓟 Δ → 𝓟 Γ

data ⟨_⟩ {a} (𝒪 : 𝒯 → Set a) : 𝒞 → Set a where
  !     : ⟨ 𝒪 ⟩ 𝟙
  ⟨_∷_⟩ : ∀ {Γ A} → ⟨ 𝒪 ⟩ Γ → 𝒪 A → ⟨ 𝒪 ⟩ (Γ · A)

𝓩 : ∀ {a} {𝒪 : 𝒯 → Set a} {Γ A} → ⟨ 𝒪 ⟩ (Γ · A) → 𝒪 A
𝓩 ⟨ _ ∷ a ⟩ = a

⟨+⟩ : ∀ {a} {𝒪 : 𝒞 → 𝒯 → Set a}
      → (∀ A → 𝒲+ (λ Δ → 𝒪 Δ A))
      → (∀ Γ → 𝒲+ (λ Δ → ⟨ 𝒪 Δ ⟩ Γ))
⟨+⟩ {𝒪 = 𝒪} + Γ w x = I Γ x
  where I : ∀ Γ → ⟨ 𝒪 _ ⟩ Γ → ⟨ 𝒪 _ ⟩ Γ
        I 𝟙       !         = !
        I (Γ · A) ⟨ γ ∷ a ⟩ = ⟨ I Γ γ ∷ + A w a ⟩
